### DataFrame에서 원소/요소 데이터 변경

In [1]:
# 모듈 로딩
import pandas as pd

In [2]:
# 데이터 준비
data={'name':['홍길동','마징가','원더우먼'],
      'job':['의적','로봇','영웅'],
      'gender':['남','남','여'],
      'age':[10,20,30],
      'height':[180,300,200]}

In [4]:
# DF 데이저 저장
dataDF=pd.DataFrame(data)
dataDF

   name job gender  age  height
0   홍길동  의적      남   10     180
1   마징가  로봇      남   20     300
2  원더우먼  영웅      여   30     200

- [원소/요소 값 변경]

In [13]:
## 홍길동의 성별 남자 => 여자
## 현재 홍길동의 정보 추출
dataDF.iloc[0,2],dataDF.loc[0]['gender']

('남', '남')

In [14]:
## '남' ==> '여'
dataDF.iloc[0,2]='여'
dataDF

   name job gender  age  height
0   홍길동  의적      여   10     180
1   마징가  로봇      남   20     300
2  원더우먼  영웅      여   30     200

In [15]:
## 원더우먼 직업 '영웅' ==> '직장인'
dataDF.iloc[2,1]='직장인'
dataDF

   name  job gender  age  height
0   홍길동   의적      여   10     180
1   마징가   로봇      남   20     300
2  원더우먼  직장인      여   30     200

- [행 전체 값 변경]

In [18]:
# [행 전체 선택] 변수명.iloc[] or 변수명.loc[]
# 1번 행 전체 추출
dataDF.iloc[1]

name      마징가
job        로봇
gender      남
age        20
height    300
Name: 1, dtype: object

In [20]:
# 1번행 값 변경 => 컬럼 개수 == 데이터 개수
dataDF.iloc[1]='아톰','영웅','여','455','15'
dataDF

   name  job gender  age height
0   홍길동   의적      여   10    180
1    아톰   영웅      여  455     15
2  원더우먼  직장인      여   30    200

In [21]:
# 1번행 값 변경 => 1개 == 데이터 개수
dataDF.iloc[1]='아톰'
dataDF

   name  job gender age height
0   홍길동   의적      여  10    180
1    아톰   아톰     아톰  아톰     아톰
2  원더우먼  직장인      여  30    200

In [22]:
# 하나의 열에서 모든 값을 하나의 값으로 바꾸기
dataDF.height=0
dataDF

   name  job gender age  height
0   홍길동   의적      여  10       0
1    아톰   아톰     아톰  아톰       0
2  원더우먼  직장인      여  30       0